export const TAGS = [
  { id: "0", name: "Об игре" },
  { id: "1", name: "Тактика" },
  { id: "2", name: "Коммуникация" },
  { id: "3", name: "Основы" },
  { id: "4", name: "Чат" },
  { id: "5", name: "Развитие сообщества" },
];

export const ARTICLES = [
  {
    id: "0",
    title: "Ground Branch",
    description: "Основная игровая дисциплина сообщества",
    cover: "/files/about-cover.jpg",
    tags: [TAGS[0], TAGS[1]],
  },
  {
    id: "1",
    title: "Run Down",
    description: 'Выход с точки высадки "Гаражи"',
    cover: "/files/article-cover.jpg",
    tags: [TAGS[3]],
  },
  {
    id: "2",
    title: "Discord",
    description: "Запущен обновленный сервер",
    cover: "",
    tags: [TAGS[4], TAGS[2]],
  },
  {
    id: "3",
    title: "Методичка",
    description: "",
    cover: "/files/article-cover.jpg",
    tags: [TAGS[3]],
  },
  {
    id: "4",
    title: "Методичка",
    description: "Особенности поведения противника в темное время суток",
    cover: "/files/article-cover.jpg",
    tags: [TAGS[3], TAGS[4]],
  },
  {
    id: "5",
    title: "Run Down",
    description: "Прохождение тактического маршрута парковка-балкон",
    cover: "/files/article-cover.jpg",
    tags: [TAGS[3]],
  },
  {
    id: "6",
    title: "Развед.сводка №017",
    description: "Август 2023",
    cover: "/files/article-cover.jpg",
    tags: [TAGS[3], TAGS[4]],
  },
  {
    id: "7",
    title: "Использование укрытий на карте training facility",
    description:
      "В GROUND BRANCH вы работаете на Центр специальных операций / Специальную оперативную группу ЦРУ (SAC/SOG) и выполняете различные задачи в составе парамилитарного подразделения",
    cover: "/files/article-cover.jpg",
    tags: [TAGS[3]],
  },
];

export const BLOCKS = [
  {
    id: "node-1",
    type: "paragraph",
    properties: {},
    children: [
      "Война - это путь обмана. ",
      {
        id: "node-33",
        type: "link",
        properties: {
          href: "#",
        },
        children: ["Поэтому"],
      },
      ", если ты и можешь что-нибудь, показывай противнику, будто не можешь; если ты и пользуешься чем-нибудь, показывай ему, будто ты этим не пользуешься; хотя бы ты и был близко, показывай, будто ты далеко; хотя бы ты и был далеко, показывай, будто ты близко; заманивай его выгодой; приведи его в расстройство и бери его; если у него все полно, будь наготове; если он силен, уклоняйся от него; вызвав в нем гнев, приведи его в состояние расстройства; приняв смиренный вид, вызови в нем самомнение; если его силы свежи, утоми его; если у него дружны воины, разъедини; нападай на него, когда он не готов; выступай, когда он не ожидает.",
    ],
  },
  {
    id: "node-3",
    type: "header",
    properties: {
      id: "Основы-коммуникации-и-взаимодействия-в-составе-тактической-единицы",
    },
    children: [
      "Основы коммуникации и взаимодействия в составе тактической единицы",
    ],
  },
  {
    id: "node-4",
    type: "paragraph",
    properties: {},
    children: [
      "Война - это путь обмана. Поэтому, если ты и можешь что-нибудь, показывай противнику, будто не можешь; если ты и пользуешься чем-нибудь, показывай ему, будто ты этим не пользуешься; хотя бы ты и был близко, показывай, будто ты далеко; хотя бы ты и был далеко, показывай, будто ты близко; заманивай его выгодой; приведи его в расстройство и бери его; если у него все полно, будь наготове; если он силен, уклоняйся от него; вызвав в нем гнев, приведи его в состояние расстройства; приняв смиренный вид, вызови в нем самомнение; если его силы свежи, утоми его; если у него дружны воины, разъедини; нападай на него, когда он не готов; выступай, когда он не ожидает.",
    ],
  },
  {
    id: "node-6",
    type: "picture",
    properties: {
      src: "/files/article-cover.jpg",
      caption: "Война - это путь обмана.",
    },
    children: [],
  },
  {
    id: "node-41",
    type: "paragraph",
    properties: {},
    children: [
      "Война - это путь обмана. Поэтому, если ты и можешь что-нибудь, показывай противнику, будто не можешь; если ты и пользуешься чем-нибудь, показывай ему, будто ты этим не пользуешься; хотя бы ты и был близко, показывай, будто ты далеко; хотя бы ты и был далеко, показывай, будто ты близко; заманивай его выгодой; приведи его в расстройство и бери его; если у него все полно, будь наготове; если он силен, уклоняйся от него; вызвав в нем гнев, приведи его в состояние расстройства; приняв смиренный вид, вызови в нем самомнение; если его силы свежи, утоми его; если у него дружны воины, разъедини; нападай на него, когда он не готов; выступай, когда он не ожидает.",
    ],
  },
  {
    id: "node-7",
    type: "header",
    properties: {
      id: "some-anchor",
    },
    children: [
      "Основы коммуникации и взаимодействия в составе тактической единицы",
    ],
  },
  {
    id: "node-61",
    type: "picture",
    properties: {
      src: "/files/about-cover.jpg",
    },
    children: [],
  },
  {
    id: "node-8",
    type: "paragraph",
    properties: {},
    children: [
      "Война - это путь обмана. Поэтому, если ты и можешь что-нибудь, показывай противнику, будто не можешь; если ты и пользуешься чем-нибудь, показывай ему, будто ты этим не пользуешься; хотя бы ты и был близко, показывай, будто ты далеко; хотя бы ты и был далеко, показывай, будто ты близко; заманивай его выгодой; приведи его в расстройство и бери его; если у него все полно, будь наготове; если он силен, уклоняйся от него; вызвав в нем гнев, приведи его в состояние расстройства; приняв смиренный вид, вызови в нем самомнение; если его силы свежи, утоми его; если у него дружны воины, разъедини; нападай на него, когда он не готов; выступай, когда он не ожидает.",
    ],
  },
];
